# Задача 1. Ошибка
# Вы обслуживаете сайт и отслеживаете возникающие проблемы. Клиент получил
# ошибку после того, как попытался добавить свой пост в систему. Вы хотите
# понять на каком из серверов эта ошибка произошла.
#
# Есть n серверов, на i-й из них приходится ai процентов запросов, из которых
# bi процентов завершаются с ошибкой. Для каждого сервера найдите вероятность
# того, что ошибка произошла именно на нём.
#
# Формат ввода
# В первой строке входного файла содержится одно целое число
# n (1 ≤n≤ 100) — количество серверов.
#
# В каждой из следующих n строк содержится два целых числа
# ai bi (0 ≤ ai, bi ≤ 100) — вероятность того что запрос пойдет на i-й сервер в
# процентах и вероятность того что на i-м сервере случится ошибка в процентах.
#
# Гарантируется, что сумма всех ai равна 100 и ошибка в системе может
# произойти.
#
# Формат вывода
# Выведите n строк. В каждой строке должно находиться одно вещественное число
# (0 ≤ pi ≤ 1) — вероятность, что ошибка произошла на соответствующем сервере.
#
# Абсолютная или относительная погрешность каждого из ответов не должна
# превышать 10-9.
# Пример 1.
# Ввод
#
# 2
# 50 1
# 50 2
# Вывод
# 0.333333333333
# 0.666666666667
#
# Пример 2.
# Ввод
#
# 3
# 10 100
# 30 10
# 60 2
# Вывод
# 0.704225352113
# 0.211267605634
# 0.084507042254

def distribution_of_errors(count_server, errors):
    arr = []
    arr_total = 0
    answer = []
    for error in errors:
        arr.append(error[0] * error[1])
        arr_total += error[0] * error[1]
    for item in arr:
        answer.append(item / arr_total)
    return answer


def main():
    count_server = 2
    error_server = ((50, 1), (50, 2))
    print(distribution_of_errors(count_server, error_server))

    count_server = 3
    error_server = ((10, 100), (30, 10), (60, 2))
    print(distribution_of_errors(count_server, error_server))


if __name__ == '__main__':
    main()
